tutorials/CFD/24rhoCentralFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5 0 -0.1)
    (5 0 -0.1)
    (5 1 -0.1)
    (-5 1 -0.1)
    (-5 0 0)
    (5 0 0)
    (5 1 0)
    (-5 1 0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1001 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (1 5 6 2)
            (0 4 5 1)
            (3 7 6 2)
            (4 5 6 7)
            (0 1 2 3)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
