tutorials/CFD/24rhoCentralFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme          Tadmor;

ddtSchemes
{
    default         CrankNicolson 0.5;
}

gradSchemes
{
    default         cellLimited<Venkatakrishnan> leastSquares 1;
}

divSchemes
{
//    default         none;

    // div(tauMC)      Gauss linear;
}

laplacianSchemes
{
    // default         Gauss cubic;
}

interpolationSchemes
{
    default         linear;

    reconstruct(rho) vanLeer 1;
    reconstruct(U)  vanLeerV 1;
    reconstruct(T)  vanLeer 1;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
