tutorials/CFD/24rhoCentralFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

//    U
//    {
//        solver          smoothSolver;
//        smoother        GaussSeidel;
//        nSweeps         2;
//        tolerance       1e-09;
//        relTol          0.01;
//    }

//    h
//    {
//        $U;
//        tolerance       1e-10;
//        relTol          0;
//    }
}


// ************************************************************************* //
